work/log.ltccip8.2020-06-12_1807/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-144.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 8
query mode: simple
number of clients: 144
number of threads: 4
duration: 300 s
number of transactions actually processed: 112664
latency average = 384.067 ms
tps = 374.934344 (including connections establishing)
tps = 374.942477 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.125  BEGIN;
         0.368  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.150  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
       252.986  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       110.465  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.169  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        19.322  END;