work/log.ltccip8.2020-06-12_1807/pgbench-timed-rw-small/iter-0/pgbench/logs/pgbench-8.log
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 8
query mode: simple
number of clients: 8
number of threads: 4
duration: 300 s
number of transactions actually processed: 91753
latency average = 26.161 ms
tps = 305.795903 (including connections establishing)
tps = 305.799362 (excluding connections establishing)
statement latencies in milliseconds:
         0.002  \set aid random(1, 100000 * :scale)
         0.001  \set bid random(1, 1 * :scale)
         0.001  \set tid random(1, 10 * :scale)
         0.001  \set delta random(-5000, 5000)
         0.056  BEGIN;
         0.171  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.117  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         1.516  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         8.957  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         0.108  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        15.396  END;